Revit 2024 API
CableTrayConduitBase.IsValidLevelId Method
 Identifies if a level id is valid.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static bool IsValidLevelId(
	Document document,
	ElementId levelId
)
Visual Basic
Public Shared Function IsValidLevelId ( _
	document As Document, _
	levelId As ElementId _
) As Boolean
Visual C++
public:
static bool IsValidLevelId(
	Document^ document,
	ElementId^ levelId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
levelId
Type: Autodesk.Revit.DB.ElementId
 The level id.
Return Value
 True if the level id is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace